docs/src/m03soa/3_solicitud_soap.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <t:Transaction xmlns:t="alguna-URI" soap:mustUnderstand="1">
      5
    </t:Transaction>
  </soap:Header> 
  <soap:Body>
    <getDetalleDeProducto xmlns="http://warehouse.example.com/ws">
      <productoId>827635</productoId>
    </getDetalleDeProducto>
  </soap:Body>
</soap:Envelope>